In [1]:
import numpy as np
import pandas as pd

In [2]:
#creating DataFrames

In [3]:
data = {
    'Name' : ['John', 'Prachi', 'Aku', 'Riya'],
    'Age' : [28, 21, 25, 17],
    'City' : ['New York', 'paris', 'Berlin', 'London'],
    'Salary' : [65000, 90000, 70000, 60000]
}

df = pd.DataFrame(data)

In [4]:
df

     Name  Age      City  Salary
0    John   28  New York   65000
1  Prachi   21     paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [5]:
data_list = [
    ['Johhn', 28, 'New York', 65000],
    ['Prachi', 21, 'Paris', 90000],
    ['Aku', 25, 'Berlin', 70000],
    ['Riya', 17, 'London', 60000]
]

df2 = pd.DataFrame(data_list, columns=['Name', 'Age', 'City', 'Salary'])
print(df2)

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [6]:
df2

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [7]:
#selection and indexing of columns

In [8]:
df2

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [9]:
df2['Name']

0     Johhn
1    Prachi
2       Aku
3      Riya
Name: Name, dtype: object

In [10]:
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [11]:
df2[['Name', 'City']]

     Name      City
0   Johhn  New York
1  Prachi     Paris
2     Aku    Berlin
3    Riya    London

In [12]:
#Creating a new column

In [13]:
df2["Designation"] = ["Doctor", "Engineer", "Data Analytics", "CA"]

In [14]:
df2

     Name  Age      City  Salary     Designation
0   Johhn   28  New York   65000          Doctor
1  Prachi   21     Paris   90000        Engineer
2     Aku   25    Berlin   70000  Data Analytics
3    Riya   17    London   60000              CA

In [15]:
#Removing column

In [16]:
df2.drop('Designation', axis = 1)

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [17]:
df2

     Name  Age      City  Salary     Designation
0   Johhn   28  New York   65000          Doctor
1  Prachi   21     Paris   90000        Engineer
2     Aku   25    Berlin   70000  Data Analytics
3    Riya   17    London   60000              CA

In [18]:
df2.drop('Designation', axis = 1, inplace = True)

In [19]:
df2

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [20]:
df2.drop(0, axis = 0)

     Name  Age    City  Salary
1  Prachi   21   Paris   90000
2     Aku   25  Berlin   70000
3    Riya   17  London   60000

In [21]:
#Selecting row

In [22]:
df2

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [25]:
df2.loc[[0,1]]

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000

In [27]:
df.iloc[1]

Name      Prachi
Age           21
City       paris
Salary     90000
Name: 1, dtype: object

In [28]:
#selecting subsets of rows and columns

In [30]:
df2.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   90000

In [31]:
df2.loc[[2,3]][['Name', 'Age']]

   Name  Age
2   Aku   25
3  Riya   17

In [32]:
#Conditional Selection

In [33]:
df2

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000
3    Riya   17    London   60000

In [34]:
#people whose age is above 20

In [35]:
df2[df2['Age'] > 20]

     Name  Age      City  Salary
0   Johhn   28  New York   65000
1  Prachi   21     Paris   90000
2     Aku   25    Berlin   70000

In [36]:
#people whose age is above 20 n are from paris

In [39]:
df2[(df2['Age'] > 20) & (df2['City'] == 'Paris')]

     Name  Age   City  Salary
1  Prachi   21  Paris   90000